fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/Forms/ФормаВвода/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	КатегорияСотрудникаСпециалист = ПолучитьЗначениеПеречисления();
	
	Если Запись.Категория = КатегорияСотрудникаСпециалист Тогда
		
		Если ПустаяСтрока(Запись.ПроцентОтРабот) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для данной категории сотрудника необходимо указать размер премии в процентах!" + Символы.ПС + "Данные не сохранены." ;
			Сообщение.Сообщить();
			Отказ = Истина;
		
		Иначе Запись.ПроцентОтРабот = Число(Запись.ПроцентОтРабот);
							
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьЗначениеПеречисления()

	Возврат Перечисления.ВКМ_КатегорииСотрудников.Специалист;
	
КонецФункции
